balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ64GP204.PIC
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="I2C1ADD" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="I2C1ADD" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="I2CADD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1ADD" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="I2C1ADD" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="I2C1MSK" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="I2C1MSK" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AMSK" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="AMSK" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:SFRDef edc:access="n-nnn-nnnnnnnnnn" edc:cname="U1MODE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000-0000000000" edc:name="U1MODE" edc:nzwidth="0x10" edc:por="0-000-0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STSEL" edc:desc="" edc:mask="0x1" edc:name="STSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDSEL" edc:desc="" edc:mask="0x3" edc:name="PDSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="URXINV" edc:desc="" edc:mask="0x1" edc:name="URXINV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAUD" edc:desc="" edc:mask="0x1" edc:name="ABAUD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPBACK" edc:desc="" edc:mask="0x1" edc:name="LPBACK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKE" edc:desc="" edc:mask="0x1" edc:name="WAKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UEN" edc:desc="" edc:mask="0x3" edc:name="UEN" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSMD" edc:desc="" edc:mask="0x1" edc:name="RTSMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IREN" edc:desc="" edc:mask="0x1" edc:name="IREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USIDL" edc:desc="" edc:mask="0x1" edc:name="USIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UARTEN" edc:desc="" edc:mask="0x1" edc:name="UARTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PDSEL0" edc:desc="" edc:mask="0x1" edc:name="PDSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PDSEL1" edc:desc="" edc:mask="0x1" edc:name="PDSEL1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="UEN0" edc:desc="" edc:mask="0x1" edc:name="UEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UEN1" edc:desc="" edc:mask="0x1" edc:name="UEN1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="UART 1" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnrrnnnrrrcr" edc:cname="U1STA" edc:desc="" edc:impl="0xefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000100010000" edc:name="U1STA" edc:nzwidth="0x10" edc:por="000-000100010000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------wwwwwwwww" edc:cname="U1TXREG" edc:desc="" edc:dma="w" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="U1TXREG" edc:nzwidth="0x10" edc:por="-------xxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UTXREG0" edc:desc="" edc:mask="0x1" edc:name="UTXREG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG1" edc:desc="" edc:mask="0x1" edc:name="UTXREG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG2" edc:desc="" edc:mask="0x1" edc:name="UTXREG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG3" edc:desc="" edc:mask="0x1" edc:name="UTXREG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG4" edc:desc="" edc:mask="0x1" edc:name="UTXREG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG5" edc:desc="" edc:mask="0x1" edc:name="UTXREG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG6" edc:desc="" edc:mask="0x1" edc:name="UTXREG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG7" edc:desc="" edc:mask="0x1" edc:name="UTXREG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTXREG8" edc:desc="" edc:mask="0x1" edc:name="UTXREG8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------rrrrrrrrr" edc:cname="U1RXREG" edc:desc="" edc:dma="r" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="U1RXREG" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="URXREG0" edc:desc="" edc:mask="0x1" edc:name="URXREG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG1" edc:desc="" edc:mask="0x1" edc:name="URXREG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG2" edc:desc="" edc:mask="0x1" edc:name="URXREG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG3" edc:desc="" edc:mask="0x1" edc:name="URXREG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG4" edc:desc="" edc:mask="0x1" edc:name="URXREG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG5" edc:desc="" edc:mask="0x1" edc:name="URXREG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG6" edc:desc="" edc:mask="0x1" edc:name="URXREG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG7" edc:desc="" edc:mask="0x1" edc:name="URXREG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="URXREG8" edc:desc="" edc:mask="0x1" edc:name="URXREG8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
